Missing data in pandas

In [21]:
import numpy as np
import pandas as pd

# import matplotlib.pyplot as plt

In [22]:
from numpy import nan as NA

In [23]:
df = pd.DataFrame([[1,2,3],[4,NA,5],[NA,NA,NA]])
df

     0    1    2
0  1.0  2.0  3.0
1  4.0  NaN  5.0
2  NaN  NaN  NaN

In [24]:
df.isnull().any()

0    True
1    True
2    True
dtype: bool

In [25]:
df.dropna(inplace=False)

     0    1    2
0  1.0  2.0  3.0

In [26]:
df

     0    1    2
0  1.0  2.0  3.0
1  4.0  NaN  5.0
2  NaN  NaN  NaN

In [27]:
# df = pd.DataFrame([[1,2,3],[4,NA,5],[NA,NA,NA]])
df[1]= NA
df

     0   1    2
0  1.0 NaN  3.0
1  4.0 NaN  5.0
2  NaN NaN  NaN

In [28]:
df.dropna(axis=1, how="all")

     0    2
0  1.0  3.0
1  4.0  5.0
2  NaN  NaN

In [29]:
df

     0   1    2
0  1.0 NaN  3.0
1  4.0 NaN  5.0
2  NaN NaN  NaN

In [30]:
df.fillna(0)

     0    1    2
0  1.0  0.0  3.0
1  4.0  0.0  5.0
2  0.0  0.0  0.0

In [31]:
# df.fillna({0:3,1:5,2:7}, inplace=True)

In [32]:
df

     0   1    2
0  1.0 NaN  3.0
1  4.0 NaN  5.0
2  NaN NaN  NaN

In [33]:
df.fillna(method="ffill", axis=1)

C:\Users\Bikesh Khyaju\AppData\Local\Temp\ipykernel_9536\2433833841.py:1: FutureWarning: DataFrame.fillna with 'method' is deprecated and will raise in a future version. Use obj.ffill() or obj.bfill() instead.
  df.fillna(method="ffill", axis=1)

     0    1    2
0  1.0  1.0  3.0
1  4.0  4.0  5.0
2  NaN  NaN  NaN

In [38]:
df.fillna(df.mean(axis=1))

     0    1    2
0  1.0  4.5  3.0
1  4.0  4.5  5.0
2  2.0  4.5  NaN